ALTER TABLE Сотрудник
ADD
CHECK (Телефон LIKE '+[0-9]-[0-9][0-9][0-9]-[0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]')
GO

ALTER TABLE Сотрудник
ADD
CHECK (Дата LIKE '[0-9][0-9].[0-9][0-9].[0-9][0-9][0-9][0-9]')
GO

ALTER TABLE Клиент
ADD
CHECK (Телефон LIKE '+[0-9]-[0-9][0-9][0-9]-[0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]')
GO

ALTER TABLE Пропуск
ADD
CHECK (Дата_активации LIKE '[0-9][0-9].[0-9][0-9].[0-9][0-9][0-9][0-9]')
GO

ALTER TABLE Пропуск
ADD
CHECK (Дата_деактивации LIKE '[0-9][0-9].[0-9][0-9].[0-9][0-9][0-9][0-9]')
GO